
// Функция подготавливает список параметров для использования при начале
// работы системы
Функция ПолучитьПараметры() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("КраткийЗаголовок", РаботаСХранилищемОбщихНастроек.ПолучитьТекстКраткогоЗаголовкаПриложения());
	
	ПараметрыПанелиЗадачОС = Новый Структура;
	ПараметрыПанелиЗадачОС.Вставить("КартинкаПроверитьПочту", БиблиотекаКартинок.ПроверитьПочту);
	ПараметрыПанелиЗадачОС.Вставить("КартинкаСписокЗаказов", БиблиотекаКартинок.СписокЗаказов);
	
	Параметры.Вставить("ПараметрыПанелиЗадачОС", ПараметрыПанелиЗадачОС);
	
	Возврат Новый ФиксированнаяСтруктура(Параметры);
	
КонецФункции

Функция ПредставлениеЦена(Цена) Экспорт
   СтрЦена = Формат(Цена, "ЧДЦ=2");
   //позиция разделителя дробной части = третий с конца 
   Если Прав(стрЦена, 2) = "00" Тогда
	   МассивФорматировнныхСтрок = Новый Массив;
   	   МассивФорматировнныхСтрок.Добавить(Лев(СтрЦена, СтрДлина(стрЦена)-3));
	   МассивФорматировнныхСтрок.Добавить(Новый ФорматированнаяСтрока(Прав(СтрЦена, 3),, Новый Цвет(190, 190, 190)));
	   Возврат Новый ФорматированнаяСтрока(МассивФорматировнныхСтрок);
   Иначе
	   Возврат Новый ФорматированнаяСтрока(СтрЦена);
   КонецЕсли;
КонецФункции
