#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ДобавитьТестовыйНабор("CI: параметры запуска")
		.ДобавитьТест("ТребуетсяОбновлениеИнформационнойБазы")
			.СПараметрами("ЗапуститьОбновлениеИнформационнойБазы;ЗавершитьРаботуСистемы;", Истина)
			.СПараметрами("  запуститьобновлениеинформационнойбазы  ;", Истина)
			.СПараметрами("", Ложь)
			.СПараметрами("ЗавершитьРаботуСистемы;", Ложь)
			.СПараметрами("ПрефиксЗапуститьОбновлениеИнформационнойБазы;", Ложь)
		;

КонецПроцедуры

Процедура ТребуетсяОбновлениеИнформационнойБазы(ПараметрЗапуска, ОжидаемыйРезультат) Экспорт

	ФактическийРезультат = СервисныеМеханизмы.ТребуетсяОбновлениеИнформационнойБазы(ПараметрЗапуска);

	ЮТест.ОжидаетЧто(ФактическийРезультат)
		.Равно(ОжидаемыйРезультат);

КонецПроцедуры

#КонецОбласти
