Функция ОтправитьЗапрос(Запрос) Экспорт
    Если Запрос.АдресРесурса <> "/suggestions/api/4_1/rs/findById/party"
        Или Запрос.Заголовки.Получить("Authorization") <> "Token unit-token" Тогда
        ВызватьИсключение "Неверный тестовый запрос";
    КонецЕсли;
    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
    Данные = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();
    Если Данные.query <> "7707083893" Тогда
        ВызватьИсключение "Неверный тестовый ИНН";
    КонецЕсли;
    Если ТекстИсключения <> "" Тогда
        ВызватьИсключение ТекстИсключения;
    КонецЕсли;
    Возврат Новый Структура("КодHTTP,Тело", КодHTTP, Тело);
КонецФункции
